# Modifying Data in SQL

In today's webinar:


### 1. Function review

**String manipulation**
- `LENGTH()` function
- `REPLACE()` function
- `CONCATENATION ||` 
- `TRIM()` functions
- `SUBSTR()` & `INSTR()` functions
- `UPPER()` & `LOWER()` function

**Data Transformation**
- `DISTINCT` function
- `CASE WHEN` function
- `IIF()` function
- `COALESCE()` function
- `NULLIF()` function
- `CAST AS` function

### 2. Exercises

- Creating queries
- Slido MCQ

## Data modification - what's the point?

In the real world, data is not always clean and ready for use. Data preparation and transformation is extremely important in ensuring your data is in a state that is usable and appropriate for your next steps, like data analysis and deriving insights, visualising your data, or machine learning. Sometimes it may be the case that while your data is clean and in a usable format, it may not be the format you need for your specific task. Let's review some of the most important and often-used SQL functions in data modification!

## Function Runthrough

First, we ensure we load our SQL extension, so that our notebook knows we are going to be running some SQL code. Next, ensure to load in your database. Make sure you have the correct path to your database, or that the database is in the same folder as your notebook. Today we'll be using the Chinook database.

In [1]:
%load_ext sql

In [2]:
%%sql

sqlite:///chinook.db

## String manipulation

### LENGTH() 

The Length() function, much like the name suggests, returns an integer of the number of characters (including whitespaces) of values in a column.

In [4]:
%%sql 

SELECT * 
FROM customers
LIMIT 5;

 * sqlite:///chinook.db
Done.

[(1, 'Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3),
 (2, 'Leonie', 'Köhler', None, 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', '+49 0711 2842222', None, 'leonekohler@surfeu.de', 5),
 (3, 'François', 'Tremblay', None, '1498 rue Bélanger', 'Montréal', 'QC', 'Canada', 'H2G 1A7', '+1 (514) 721-4711', None, 'ftremblay@gmail.com', 3),
 (4, 'Bjørn', 'Hansen', None, 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', '+47 22 44 22 22', None, 'bjorn.hansen@yahoo.no', 4),
 (5, 'František', 'Wichterlová', 'JetBrains s.r.o.', 'Klanova 9/506', 'Prague', None, 'Czech Republic', '14700', '+420 2 4172 5555', '+420 2 4172 5555', 'frantisekw@jetbrains.com', 4)]

In [5]:
%%sql
SELECT
    FirstName,
    LastName,
    LENGTH(FirstName) AS LengthOfFirstName
FROM
    customers
LIMIT 5;

 * sqlite:///chinook.db
Done.

[('Luís', 'Gonçalves', 4),
 ('Leonie', 'Köhler', 6),
 ('François', 'Tremblay', 8),
 ('Bjørn', 'Hansen', 5),
 ('František', 'Wichterlová', 9)]

---

### REPLACE()

The Replace() function can replace occurences of a substring within a string, with a new substring that you specify. the general syntax is:

`REPLACE(string/column, old_string, new_string)`

In [8]:
%%sql
SELECT 
    ADDRESS,
    REPLACE(ADDRESS,'Street', 'Str.') AS ShortenedStreet
FROM CUSTOMERS
WHERE ADDRESS like '%Street%'

 * sqlite:///chinook.db
Done.

[('700 W Pender Street', '700 W Pender Str.'),
 ('801 W 4th Street', '801 W 4th Str.'),
 ('69 Salem Street', '69 Salem Str.'),
 ('162 E Superior Street', '162 E Superior Str.'),
 ('319 N. Frances Street', '319 N. Frances Str.'),
 ('2211 W Berry Street', '2211 W Berry Str.'),
 ('796 Dundas Street West', '796 Dundas Str. West'),
 ('230 Elgin Street', '230 Elgin Str.'),
 ('696 Osborne Street', '696 Osborne Str.'),
 ('5112 48 Street', '5112 48 Str.'),
 ('3 Chatham Street', '3 Chatham Str.'),
 ('202 Hoxton Street', '202 Hoxton Str.'),
 ('421 Bourke Street', '421 Bourke Str.')]

---

### CONCATENATION ||

In SQLite, we use the || as an indication of concatentation. Other flavours of SQL may use the CONCAT() function. The concatenation operator allows us to put strings of characters or numbers together. It can also be used to put entire columns together!

In [9]:
%%sql
SELECT 
    CITY,
    COUNTRY,
    CITY || ', ' || COUNTRY AS FullAddress
FROM 
    CUSTOMERS
LIMIT 5

 * sqlite:///chinook.db
Done.

[('São José dos Campos', 'Brazil', 'São José dos Campos, Brazil'),
 ('Stuttgart', 'Germany', 'Stuttgart, Germany'),
 ('Montréal', 'Canada', 'Montréal, Canada'),
 ('Oslo', 'Norway', 'Oslo, Norway'),
 ('Prague', 'Czech Republic', 'Prague, Czech Republic')]

---

### TRIMMING - RTRIM(), LTRIM, TRIM()

Trimming functions get rid of any trailing whitespace in our strings. RTRIM() removes any whitespace to the right of the string, LTRIM() removes any whitespace to the left of the string, and TRIM() removes from both the left and right of the string. Note that it does not remove spaces within the string, as this is not 'trailing' whitespace.

In [207]:
%%sql
SELECT
    BNAME,
    LENGTH(BNAME)AS LengthOfFirstName,
    LENGTH(TRIM(BNAME)) AS TRIM_Length,
    LENGTH(LTRIM(BNAME)) AS LTRIM_Length,
    LENGTH(RTRIM(BNAME)) AS RTRIM_Length
FROM
    (SELECT ' ' || FirstName || '  ' AS BNAME FROM CUSTOMERS)  AS BNAME -- one trailing space on the left, two on the right
LIMIT 5;

 * sqlite:///chinook.db
Done.

[(' Luís  ', 7, 4, 6, 5),
 (' Leonie  ', 9, 6, 8, 7),
 (' François  ', 11, 8, 10, 9),
 (' Bjørn  ', 8, 5, 7, 6),
 (' František  ', 12, 9, 11, 10)]

---

### SUBSTR()

The substring function returns a column with a particular substring from your original string. With the substring function, you define the starting index, and how many characters from the starting index you want to return. NB: In SQL, indexing starts at 1, unlike Python where indexing starts at 0.

The general syntax is:

`SUBSTR(string/column, start_index, length)`


![](https://www.sqlitetutorial.net/wp-content/uploads/2016/05/sqlite-substr.png)

In [10]:
%%sql
SELECT 
    Phone,
    SUBSTR(Phone, 1, 3) AS PhoneCode,
    LENGTH(SUBSTR(Phone, 1, 3)) as SubstrLength
FROM CUSTOMERS
LIMIT 5

 * sqlite:///chinook.db
Done.

[('+55 (12) 3923-5555', '+55', 3),
 ('+49 0711 2842222', '+49', 3),
 ('+1 (514) 721-4711', '+1 ', 3),
 ('+47 22 44 22 22', '+47', 3),
 ('+420 2 4172 5555', '+42', 3)]

---

### INSTR()

The INSTR() function returns the first index at which a specified character appears in a string. If the character does not appear in the string, it will return 0.

General syntax:

`INSTR(string/column, character)`

In [12]:
%%sql

SELECT
    Email,
    INSTR(Email, 'b') AS IndexAt
FROM CUSTOMERS
LIMIT 5;

 * sqlite:///chinook.db
Done.

[('luisg@embraer.com.br', 9),
 ('leonekohler@surfeu.de', 0),
 ('ftremblay@gmail.com', 6),
 ('bjorn.hansen@yahoo.no', 1),
 ('frantisekw@jetbrains.com', 15)]

---

### UPPER() AND LOWER()

Much like the names suggest, the UPPER() and LOWER() functions can convert strings to upper or lower case. Note in the example below, special characters are not converted to uppercase!

In [13]:
%%sql
SELECT
    FirstName,
    UPPER(FirstName) AS UpperCaseFirstName,
    LOWER(FirstName) AS LowerCaseFirstName
FROM CUSTOMERS
LIMIT 5

 * sqlite:///chinook.db
Done.

[('Luís', 'LUíS', 'luís'),
 ('Leonie', 'LEONIE', 'leonie'),
 ('François', 'FRANçOIS', 'françois'),
 ('Bjørn', 'BJøRN', 'bjørn'),
 ('František', 'FRANTIšEK', 'františek')]

---

## Data Manipulations & Transformation

### DISTINCT

The DISTINCT function allows us to return **unique** values in a column. Imagine we wanted to know from our dataset exactly which countries our customers are from. Of course we likely have multiple customers from the same country, but we don't want to see all these duplications. We can use the DISTINCT function to return only one occurence of each. 


NB: DISTINCT is case-sensitive. If the we had an entry of 'Brazil' and another of 'brazil', these would be counted as separate countries - how could we get around this?


The DISTINCT function can be used in conjunction with thr COUNT() function for further insight - how many countries are we selling to?

In [16]:
%%sql
SELECT COUNT(DISTINCT Country)
FROM customers

 * sqlite:///chinook.db
Done.

[(24,)]

---

### CASE

The CASE function is a form of using an IF-THEN-ELSE statement that is used often in programming. It is used in conjuction with the WHEN statement in order to create the conditions. The 'ELSE' clause is not always needed, the expression can be complete with just WHEN statements.


General syntax:

`CASE
    WHEN conditon_1 THEN result_1
    WHEN conditon_2 THEN result_2
    .
    .
    .
    WHEN conditon_n THEN result_n
[ELSE result_n+1]
END AS ColumnName`

In [17]:
%%sql
SELECT 
    FirstName,
    LastName,
    Company,
    CASE
        WHEN Company is null then 'Unemployed'
        WHEN Company is not null then 'Employed'
    END AS EmploymentStatus
FROM customers  
LIMIT 5;

 * sqlite:///chinook.db
Done.

[('Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Employed'),
 ('Leonie', 'Köhler', None, 'Unemployed'),
 ('François', 'Tremblay', None, 'Unemployed'),
 ('Bjørn', 'Hansen', None, 'Unemployed'),
 ('František', 'Wichterlová', 'JetBrains s.r.o.', 'Employed')]

In [18]:
%%sql
SELECT 
    FirstName,
    LastName,
    Company,
    CASE
        WHEN Company is null then 'Unemployed'
    ELSE 'Employed'
    END AS EmploymentStatus
FROM customers 
LIMIT 5;

 * sqlite:///chinook.db
Done.

[('Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Employed'),
 ('Leonie', 'Köhler', None, 'Unemployed'),
 ('François', 'Tremblay', None, 'Unemployed'),
 ('Bjørn', 'Hansen', None, 'Unemployed'),
 ('František', 'Wichterlová', 'JetBrains s.r.o.', 'Employed')]

---

### IIF()

The IIF() function is similar to CASE in that it is a version of using an IF-ELSE statement. The syntax of the IIF() function is very similar to what you may see in something like Excel or in DAX formulas:

`IIF(condition, result_if_true, result_if_false)`

IIF() statements can also be nested, if you have multiple conditions. Think about how you created the Season column back in the Visualisation sprint!

NB: The IIF() function is available from version 3.32.0 of SQLite onwards. If the below cell returns an error, you may need to update your SQLite installation. Also note that this cell will not run in Colab, as it uses a deprecated version of sqlite3.

In [19]:
%%sql
SELECT
    FirstName,
    LastName,
    Company,
    IIF(Company is null,'Unemployed','Employed') AS EmploymentStatus
FROM
    Customers
LIMIT 5;

 * sqlite:///chinook.db
Done.

[('Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Employed'),
 ('Leonie', 'Köhler', None, 'Unemployed'),
 ('François', 'Tremblay', None, 'Unemployed'),
 ('Bjørn', 'Hansen', None, 'Unemployed'),
 ('František', 'Wichterlová', 'JetBrains s.r.o.', 'Employed')]

---

### COALESCE()

The COALESCE() function will return the first non-null value if given a list of values, or has the power to replace null values in a column with a specified value, as a new column. This is particularly useful if we have nulls in a dataset that we want to replace with a default value!

In [21]:
%%sql

SELECT COALESCE(null, 'ab', 30);

 * sqlite:///chinook.db
Done.

[('ab',)]

In [23]:
%%sql

SELECT
    FirstName,
    LastName,
    Company,
    COALESCE(Company, '-') AS EmploymentStatus
FROM
    Customers
LIMIT 5;

 * sqlite:///chinook.db
Done.

[('Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Embraer - Empresa Brasileira de Aeronáutica S.A.'),
 ('Leonie', 'Köhler', None, '-'),
 ('François', 'Tremblay', None, '-'),
 ('Bjørn', 'Hansen', None, '-'),
 ('František', 'Wichterlová', 'JetBrains s.r.o.', 'JetBrains s.r.o.')]

---

### NULLIF()

The NULLIF() function compares two arguments passed into it, and evaluates whether the two values are equal or not. If they are equal, the function will return null or None. If not, it will return the first value passed to it.

This function is particularly useful in datasets where we may want to replace empty strings or zeroes with a null to help with other aggregation functions and calculations. In this way it can act as a sort of opposite function to the COALESCE() function described above.

In [25]:
%%sql
SELECT NULLIF('11', 11)

 * sqlite:///chinook.db
Done.

[('11',)]

In [26]:
%%sql
SELECT NULLIF('abc', 'ab')

 * sqlite:///chinook.db
Done.

[('abc',)]

In [27]:
%%sql
SELECT
    BillingAddress, 
    BillingCity, 
    BillingState, 
    BillingCountry, 
    Total, 
    NULLIF(BillingCountry, 'Germany') AS ShippingFee
FROM invoices
WHERE BillingCountry = 'Germany'
LIMIT 5;

 * sqlite:///chinook.db
Done.

[('Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', 1.98, None),
 ('Berger Straße 10', 'Frankfurt', None, 'Germany', 0.99, None),
 ('Barbarossastraße 19', 'Berlin', None, 'Germany', 1.98, None),
 ('Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', 13.86, None),
 ('Tauentzienstraße 8', 'Berlin', None, 'Germany', 1.98, None)]

---

### CAST

The CAST function allows us to alter datatypes. This is very useful in cleaning our data, as we may not always get data in the format or datatype that we want to use it in. In the below example, division of the milliseconds produces and integer output, but perhaps we want our output to be a bit more precise. We can CAST our milliseconds as the datatype REAL to do so.

In [206]:
%%sql

SELECT 
    Name, 
    Milliseconds, 
    Milliseconds/1000 as Seconds, 
    CAST(Milliseconds as REAL)/1000 as Seconds_real,
    Milliseconds/60000 as Minutes,
    CAST(Milliseconds as REAL)/60000 as Minutes_real,
    TIME(Milliseconds/1000, 'unixepoch') as TimeFormat
FROM tracks
LIMIT 5;

 * sqlite:///chinook.db
Done.

[('For Those About To Rock (We Salute You)', 343719, 343, 343.719, 5, 5.72865, '00:05:43'),
 ('Balls to the Wall', 342562, 342, 342.562, 5, 5.709366666666667, '00:05:42'),
 ('Fast As a Shark', 230619, 230, 230.619, 3, 3.84365, '00:03:50'),
 ('Restless and Wild', 252051, 252, 252.051, 4, 4.20085, '00:04:12'),
 ('Princess of the Dawn', 375418, 375, 375.418, 6, 6.256966666666667, '00:06:15')]

---

## Exercises

1. Return a table with the customers FirstName, LastName, Length of first name, and Length of full name (first and last name).

In [30]:
%%sql
SELECT
...
FROM
...
LIMIT 5;

 * sqlite:///chinook.db
Done.

[('Luís', 'Gonçalves', 4, 13),
 ('Leonie', 'Köhler', 6, 12),
 ('François', 'Tremblay', 8, 16),
 ('Bjørn', 'Hansen', 5, 11),
 ('František', 'Wichterlová', 9, 20)]

2. Suppose we have a weird problem with our system, where we cannot use the '@' symbol. Return a table with Email, and a column called NoSpecialCharacters where we replace @ with [at]

In [31]:
%%sql
SELECT
...
FROM
...
LIMIT 5;

 * sqlite:///chinook.db
Done.

[('luisg@embraer.com.br', 'luisg[at]embraer.com.br'),
 ('leonekohler@surfeu.de', 'leonekohler[at]surfeu.de'),
 ('ftremblay@gmail.com', 'ftremblay[at]gmail.com'),
 ('bjorn.hansen@yahoo.no', 'bjorn.hansen[at]yahoo.no'),
 ('frantisekw@jetbrains.com', 'frantisekw[at]jetbrains.com')]

3. Let's say we're shipping from the USA. We want to list in our table whether our customers are local/national, or international in order to help our data analysis and get insights into how much we're shipping overseas versus nationally. Return a table with CustomerId, BillingCountry and a column indicating whether the customer's billing country is 'National' (in the USA) or 'International'.


Hint: There are at least two ways to do this!

In [32]:
%%sql
SELECT
...
FROM
...
LIMIT 5;

 * sqlite:///chinook.db
Done.

[(2, 'Germany', 'International'),
 (4, 'Norway', 'International'),
 (8, 'Belgium', 'International'),
 (14, 'Canada', 'International'),
 (23, 'USA', 'National')]

4. We want to make default usernames for our customers to log in to a new website we've created. These usernames will be the first part of their email address. Return a table with customers Email, and the first part of their email address before the @ symbol (e.g. claudia@explore.ai --> claudia)

Hint: You need to use two functions together to achieve this...

In [185]:
%%sql
SELECT
...
FROM
...
LIMIT 5;

 * sqlite:///chinook.db
Done.

[('luisg@embraer.com.br', 'luisg'),
 ('leonekohler@surfeu.de', 'leonekohler'),
 ('ftremblay@gmail.com', 'ftremblay'),
 ('bjorn.hansen@yahoo.no', 'bjorn.hansen'),
 ('frantisekw@jetbrains.com', 'frantisekw')]

**BONUS**: Can you extract just the email domain from the email addresses as a new column? (e.g. claudia@explore.ai --> explore.ai)


Hint: This will be pretty similar to the above, but think about the indexing and what portion of the string you are trying to extract...

In [ ]:
%%%sql
SELECT
...
FROM
...
LIMIT 5